<<<<<<< HEAD
#include <stdio.h>
#include <stdlib.h>
#include <conio.h>  

//ÀÌ¹ø¿¡ ¹è¿î 4ÁÖÂ÷ c¾ğ¾î »ùÇÃ°ú 0À» ÁÂ¿ì·Î ÀÌµ¿½ÃÅ°´Â °ÔÀÓÀ» ÇÕÃÄº¸¾Ò½À´Ï´Ù.

#define WIDTH 40  //°ÔÀÓÈ­¸é Å©±â

int print_game(int position) {
    system("cls");  

    for (int i = 0; i < WIDTH; i++) {
        if (i == position)
            printf("0");
        else
            printf("_");
    }
    printf("\n");
}

int showMenu() { // °ÔÀÓ ÃÊ±â È­¸é
    puts("************************************");
    puts("*     0À» ÁÂ¿ì·Î ¿òÁ÷ÀÌ´Â °ÔÀÓ     *");
    puts("************************************");
    puts("");
    puts("1. °ÔÀÓ½ÃÀÛ");
    puts("2. Á¾·á");
    return 0;
}

int main() { //A¿Í D¸¦ ÀÌ¿ëÇÏ¿© 0À» ¿òÁ÷ÀÌ°Ô ÇÏ´Â ÄÚµå

    showMenu();

    char input = _getch();  

    if (input == '1') {
        int position = WIDTH / 2;  

        while (1) {
            if (_kbhit()) {  
                char ch = _getch();  

                if (ch == 'a' || ch == 'A') {
                    if (position > 0)  
                        position--;
                }
                else if (ch == 'd' || ch == 'D') {
                    if (position < WIDTH - 1)  
                        position++;
                }
            }

            print_game(position);
        }
    }
    else if (input == '2') { //¼ıÀÚÅ° 2¸¦ ´­·¶À» ¶§ ³ª¿À´Â È­¸é
        puts("°ÔÀÓÀ» Á¾·áÇÕ´Ï´Ù.");
    }
    else { //¼ıÀÚÅ° 1°ú 2¸¦ Á¦¿ÜÇÑ ´Ù¸¥ Å°¸¦ ´­·¶À» ¶§ ³ª¿À´Â È­¸é
        puts("1¹ø°ú 2¹ø Áß ÇÏ³ª¸¦ ´­·¯ÁÖ¼¼¿ä.");
    }

    return 0;
=======
//ANSI(American National Standards Institute)
//- ANSI ÄÚµå(ANSI Escape Code)´Â ÅØ½ºÆ® ±â¹İÀÇ ÅÍ¹Ì³Î¿¡¼­ È­¸éÀÇ ½ºÅ¸ÀÏÀ» Á¦¾îÇÏ´Â µ¥ »ç¿ëµÇ´Â Æ¯¼öÇÑ Á¦¾î ¹®ÀÚ
//- ÀÌ Ç¥ÁØÀº ÅÍ¹Ì³Î¿¡¼­ ÅØ½ºÆ®ÀÇ »ö»ó, ¹è°æ»ö, ±½±â, ¹ØÁÙ, ±ô¹ÚÀÓ µîÀÇ ¼Ó¼ºÀ» ¼³Á¤ÇÏ°Å³ª º¯°æÇÒ ¼ö ÀÖ´Â ¹æ¹ıÀ» Á¤ÀÇ
//
//ÅØ½ºÆ® »ö»ó
//\033[30m:°ËÀº»ö
//\033[31m:»¡°£»ö
//\033[32m:ÃÊ·Ï»ö
//\033[33m:³ë¶õ»ö
//\033[34m:ÆÄ¶õ»ö
//\033[35m:ÀÚÁÖ»ö
//\033[36m:Ã»·Ï»ö
//\033[37m:Èò»ö
//
//¹è°æ »ö»ó
//\033[40m:°ËÀº»ö ¹è°æ
//\033[41m:»¡°£»ö ¹è°æ
//\033[42m:ÃÊ·Ï»ö ¹è°æ
//\033[43m:³ë¶õ»ö ¹è°æ
//\033[44m:ÆÄ¶õ»ö ¹è°æ
//\033[45m:ÀÚÁÖ»ö ¹è°æ
//\033[46m:Ã»·Ï»ö ¹è°æ
//\033[47m:Èò»ö ¹è°æ
//
//ÅØ½ºÆ® ½ºÅ¸ÀÏ
//\033[1m:±½Àº ±Û¾¾
//\033[4m:¹ØÁÙ
//\033[7m:¹İÀü(¹è°æ°ú ±ÛÀÚ»öÀ» ¹İÀü)
//
//ÃÊ±âÈ­ ÄÚµå
//\033[0m:¸ğµç ½ºÅ¸ÀÏ ÃÊ±âÈ­(±âº» ÅØ½ºÆ® ¼Ó¼ºÀ¸·Î µ¹¾Æ°¨)

int main() {
    // »¡°£»ö ÅØ½ºÆ®
    puts("\033[31mÀÌ ÅØ½ºÆ®´Â »¡°£»öÀÔ´Ï´Ù.\033[0m\n");

    // ÃÊ·Ï»ö ÅØ½ºÆ®¿Í ³ë¶õ»ö ¹è°æ
    puts("\033[32m\033[43mÀÌ ÅØ½ºÆ®´Â ÃÊ·Ï»öÀÌ°í ¹è°æÀº ³ë¶õ»öÀÔ´Ï´Ù.\033[0m\n");

    // ±½Àº ÅØ½ºÆ®¿Í ÆÄ¶õ»ö ÅØ½ºÆ®
    puts("\033[1m\033[34mÀÌ ÅØ½ºÆ®´Â ±½°í ÆÄ¶õ»öÀÔ´Ï´Ù.\033[0m\n");

    return 0;
>>>>>>> 08e4257 (ì¤‘ê°„ëŒ€ë¹„)
}